import { TANK_TYPE } from './types'

/** Цвета для раскраски танков разных игроков */
export const PLAYER_COLORS = ['#ffffff', '#000000']

/** Соответствие типа танка и его характеристик */
export const TANK_TYPE_TO_PROPS: Record<
  TANK_TYPE,
  {
    damage: number
    energy: number
    armor: number
  }
> = {
  [TANK_TYPE.CLT]: {
    armor: 1,
    damage: 1,
    energy: 5,
  },
  [TANK_TYPE.LT]: {
    armor: 1,
    damage: 1,
    energy: 5,
  },
  [TANK_TYPE.MT]: {
    armor: 2,
    damage: 2,
    energy: 4,
  },
  [TANK_TYPE.HT]: {
    armor: 3,
    damage: 3,
    energy: 3,
  },
}

/**
 * Шаблон доски. Правила обработки описаны в {@link Board.createFromTemplate}
 * Соответствие буквы и типа танка в {@link CHAR_TO_TANK_TYPE}
 * Соответствие символа и типа элемента на доске в {@link CHARS}
 * Символы верхнего регистра для танков первого игрока, в нижнем для второго
 */
export const START_BOARD_TEMPLATE = `
      A   B   C   D   E    F   G    H    I    J   K   L    M     N    O    P
   ——————————————————————————————————————————————————————————————————————————
16|  --  --  --  h🡣  --   --   m🡣  --   c🡣  --  m🡣  --   --   h🡣   --   -- |16
15|  --  @@  --  --  @@   @@   --   --   --  --   --  --   --   --   --   -- |15
14|  --  @@  --  l🡣  @@   @@   l🡣  --   m🡣  --  l🡣  @@   @@   l🡣   --   -- |14
13|  --  @@  --  --  @@   --   --   --   --  --   --  --   --   --   --   -- |13
12|  --  --  --  --  --   --   --   @@   @@  --   --  --   --   --   --   -- |12
11|  --  --  --  --  --   --   @@   @@   @@  @@   @@  --   --   @@   @@   -- |11
10|  --  --  @@  @@  --   --   --   --   --  --   --  --   --   --   @@   -- |10
09|  --  --  @@  @@  @@   --   --   --   --  --   --  --   --   --   --   -- |09
08|  --  --  --  --  --   --   --   --   --  --   --  @@   @@   @@   --   -- |08
07|  --  @@  --  --  --   --   --   --   --  --   --  --   @@   @@   --   -- |07
06|  --  @@  @@  --  --   @@   @@   @@   @@  @@   --  --   --   --   --   -- |06
05|  --  --  --  --  --   --   --   @@   @@  --   --  --   --   --   --   -- |05
04|  --  --  --  --  --   --   --   --   --  --   --  @@   --   --   @@   -- |04
03|  --  --  L🡡  @@  @@   L🡡  --   M🡡   --  L🡡  @@  @@   L🡡   --   @@   -- |03
02|  --  --  --  --  --   --   --   --   --  --   @@  @@   --   --   @@   -- |02
01|  --  --  H🡡  --  --   M🡡  --   C🡡   --  M🡡  --  --   H🡡   --   --   -- |01
   ——————————————————————————————————————————————————————————————————————————
      A   B   C   D   E    F   G    H    I    J   K   L    M     N    O    P
`

export const CHARS = {
  ARROWS: ['🡡', '🡥', '🡢', '🡦', '🡣', '🡧', '🡠', '🡤'],
  WALL: '@@',
  EMPTY: '--',
}

export const CHAR_TO_TANK_TYPE: Record<string, TANK_TYPE> = {
  H: TANK_TYPE.HT,
  M: TANK_TYPE.MT,
  L: TANK_TYPE.LT,
  C: TANK_TYPE.CLT,
}
